#+TITLE: Org Timeline Viewer from Org Tables - Test 2
* Import Org-tables into pandas
After checking a [[https://stackoverflow.com/questions/67064546/elegant-way-to-read-emacs-org-mode-tables-into-a-python-pandas-dataframe/67064574#67064574][couple]] of Stack Overflow [[https://emacs.stackexchange.com/questions/63505/how-to-open-org-mode-table-as-a-pandas-dataframe-with-column-names][articles]], it seems quite simple to import a Org-table into pandas passing it as a variable to the pd.DataFrame function.

Given we are not reading using pd.read_csv to read the CSV, we must convert date and agenda-day to dates manually.

#+begin_src python :session org-timeline-viewer :var tbl=test2 :colnames no :hlines :results replace
import pandas as pd
timeline = pd.DataFrame(tbl[1:], columns=tbl[0])
# Trying to use this function: timeline['date'] = pd.to_datetime(timeline['date'])
# Returns dateutil.parser._parser.ParserError: Unknown string format: [2015-12-13 Sun 17:14]
# Let's remove the brackets first
timeline['date'] = timeline['date'].str.strip('[]')
# Now, we can convert it to a datetime64 type
timeline['date'] = pd.to_datetime(timeline['date'])
timeline['date'].dtype
#+end_src

#+RESULTS:
: datetime64[ns]

Workaround: Org doesn't export end date, so we rename date as start_date, then add a day for the end_date.

Limitation: Dates must comply with ISO 8601 format. Right now, we can't add any kind of intervals for times or dates. Pandas will complain and it won't work.

#+begin_src python :session org-timeline-viewer
timeline.rename(columns={'date':'start_date'}, inplace=True)
timeline['end_date'] = timeline['start_date'] + pd.Timedelta(days=1)
# TODO Debug output to be removed in the future
timeline.head()
#+end_src

#+RESULTS:
:            start_date   volume            notes  liter_per_day eur_day            end_date
: 0 2015-12-13 17:14:00  32.5809  unclear history            222         2015-12-14 17:14:00
: 1 2016-04-08 16:41:00  60.5927  unclear history            239         2016-04-09 16:41:00
: 2 2016-04-16 13:07:00  62.4217  unclear history            233         2016-04-17 13:07:00
: 3 2016-05-01 12:59:00  66.8509                             295         2016-05-02 12:59:00
: 4 2016-06-01 18:26:00  74.1914                             235         2016-06-02 18:26:00

